wms first cut
